app/Http/Controllers/IndikatorMutuController.php

    public function index()
    {
        // mendapatkan data user yang telah berhasil login
        if (auth()->check()) {
            $user_data = auth()->user();
        }
        // mengambil data indikator_mutu(bersifat many) dari unit(relasi dengan user) yang telah login
        $indikator_mutu = $user_data->unit->indikator_mutu()->paginate(5);
---
SELECT * FROM `indikator_mutu` LIMIT 5 offset 0
SELECT * FROM `units` LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `indikator_mutu`
SELECT count(*) as aggregate FROM `units`