app/Http/Controllers/IndikatorMutuController.php

    public function index()
    {
        // mendapatkan data user yang telah berhasil login
         $user_data = auth()->user();
        // mengambil data indikator_mutu (bersifat many) dari unit(relasi dengan user) yang telah login
        $indikator_mutu = IndikatorMutu::with(['unit','pengukuran_mutu'])->where('unit_id',$user_data->unit->id)->paginate(5);
---
SELECT * FROM `indikator_mutu` WHERE `indikator_mutu`.`unit_id` = 2 and `indikator_mutu`.`unit_id` IS not NULL LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `indikator_mutu` WHERE `indikator_mutu`.`unit_id` = 2 and `indikator_mutu`.`unit_id` IS not NULL
SELECT * FROM `pengukuran_mutu` WHERE `pengukuran_mutu`.`indikator_mutu_id` in (1, 2, 3, 4, 5)
SELECT * FROM `units` WHERE `units`.`id` in (1, 2)

    public function create()
    {
        $data_unit = Unit::all();
---
SELECT * FROM `units`

    public function store(StoreIndikatorMutuRequest $request)
    {
        IndikatorMutu::create($request->validated());
---
INSERT INTO `indikator_mutu` (`unit_id`, `nama_indikator`, `nama_numerator`, `nama_denumerator`, `updated_at`, `created_at`) VALUES ('2', 'sdfsdf', 'sdf', 'sdf', '2023-05-11 14:23:43', '2023-05-11 14:23:43')

    public function getRekap(Request $request){
        $tanggal = $request->input('tanggal');
        $bulan = $request->input('bulan');
        $indikatorMutu = $request->input('indikator_mutu_id');
        $rekap = PengukuranMutu::where('tanggal_input', 'like', "%{$bulan}%")->where('indikator_mutu_id','=',$indikatorMutu)->get();
        $indikator_mutu = IndikatorMutu::find($indikatorMutu);
---
SELECT * FROM `pengukuran_mutu` WHERE `tanggal_input` like '%2023-05%' and `indikator_mutu_id` = '1'
SELECT * FROM `indikator_mutu` WHERE `indikator_mutu`.`id` = '1' LIMIT 1

    public function showChart()
    {

        $avgBulan = [];
        foreach (AverageBulan::all() as $avg) {
            $avgBulan[] = $avg->avgBulan;
        }

        $tanggal = [];
        foreach (AverageBulan::all() as $tgl) {
---
SELECT * FROM `avg_bulan`