app/Http/Controllers/PengukuranMutuController.php

SELECT * FROM `pengukuran_mutu` WHERE `indikator_mutu_id` = 1 and month(`tanggal_input`) = '05'
---
    public function showChart()
    {
       // get data from PengukuranMutu model
       $datas = DB::table('pengukuran_mutu')->where('indikator_mutu_id', 1)->whereMonth('tanggal_input', 4)->get();

SELECT * FROM `indikator_mutu` WHERE `indikator_mutu`.`unit_id` = 2 and `indikator_mutu`.`unit_id` IS not NULL
SELECT * FROM `units` WHERE `units`.`user_id` = 2 and `units`.`user_id` IS not NULL LIMIT 1
---
    public function inputHarian($id)
    {
        $cur_indikator = auth()->user()->unit->indikator_mutu->find($id);

INSERT INTO `pengukuran_mutu` (`numerator`, `denumerator`, `indikator_mutu_id`, `tanggal_input`, `prosentase`, `updated_at`, `created_at`) VALUES ('3', '5', '1', '2023-05-12', 60, '2023-05-12 10:10:22', '2023-05-12 10:10:22')
---
    public function store(StorePengukuranMutuRequest $request)
    {
        //get value of numerator from request
        $numerator = $request->input('numerator');
        //get value of denumerator from request
        $denumerator = $request->input('denumerator');

        // return error if denumerator smaller than numerator
        if ($denumerator < $numerator) return redirect()->route('indikator-mutu.index')->with('error', 'Data Gagal Diinput! periksa kembali inputan');

        // count the percentage from numerator and denumerator
        $percentage = $numerator / $denumerator * 100;
        // set the value of percentage to request
        $request->merge(['prosentase' => $percentage]);
        // store all data to database in tabel PengukuranMutu
        PengukuranMutu::create($request->all());